Logical05/Studio_1_DoF/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define RCC_OSC32_IN_Pin GPIO_PIN_14
#define RCC_OSC32_IN_GPIO_Port GPIOC
#define SSR_TRIG_Pin GPIO_PIN_15
#define SSR_TRIG_GPIO_Port GPIOC
#define RCC_OSC_IN_Pin GPIO_PIN_0
#define RCC_OSC_IN_GPIO_Port GPIOF
#define RCC_OSC_OUT_Pin GPIO_PIN_1
#define RCC_OSC_OUT_GPIO_Port GPIOF
#define PROX_IN_Pin GPIO_PIN_3
#define PROX_IN_GPIO_Port GPIOC
#define LPUART1_TX_Pin GPIO_PIN_2
#define LPUART1_TX_GPIO_Port GPIOA
#define LPUART1_RX_Pin GPIO_PIN_3
#define LPUART1_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define REED_DOWN_Pin GPIO_PIN_1
#define REED_DOWN_GPIO_Port GPIOB
#define REED_UP_Pin GPIO_PIN_2
#define REED_UP_GPIO_Port GPIOB
#define MOTOR_DIR_Pin GPIO_PIN_11
#define MOTOR_DIR_GPIO_Port GPIOB
#define REED_OPEN_Pin GPIO_PIN_14
#define REED_OPEN_GPIO_Port GPIOB
#define REED_CLOSE_Pin GPIO_PIN_15
#define REED_CLOSE_GPIO_Port GPIOB
#define ENCODER_A_Pin GPIO_PIN_6
#define ENCODER_A_GPIO_Port GPIOC
#define ENCODER_B_Pin GPIO_PIN_7
#define ENCODER_B_GPIO_Port GPIOC
#define PS_TX_Pin GPIO_PIN_9
#define PS_TX_GPIO_Port GPIOA
#define PS_RX_Pin GPIO_PIN_10
#define PS_RX_GPIO_Port GPIOA
#define MOTOR_PWM_Pin GPIO_PIN_12
#define MOTOR_PWM_GPIO_Port GPIOA
#define GP_DOWN_Pin GPIO_PIN_15
#define GP_DOWN_GPIO_Port GPIOA
#define RESET_5W_IN_Pin GPIO_PIN_11
#define RESET_5W_IN_GPIO_Port GPIOC
#define RESET_5W_IN_EXTI_IRQn EXTI15_10_IRQn
#define RELAY_IN_Pin GPIO_PIN_12
#define RELAY_IN_GPIO_Port GPIOC
#define T_SWO_Pin GPIO_PIN_3
#define T_SWO_GPIO_Port GPIOB
#define ENCODER_Z_Pin GPIO_PIN_6
#define ENCODER_Z_GPIO_Port GPIOB
#define GP_UP_Pin GPIO_PIN_7
#define GP_UP_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
